# [SQL using Python](https://www.geeksforgeeks.org/sql-using-python)

In [ ]:
# ! pip install mysql-connector-python

In [ ]:
import sqlite3

In [ ]:
sqliteConnection = sqlite3.connect('gfg.db')
sqliteConnection

In [ ]:
cursor = sqliteConnection.cursor()
cursor

In [ ]:
import sqlite3
 
# connecting to the database
connection = sqlite3.connect("gfg.db")
 
# cursor
crsr = connection.cursor()
 
# print statement will execute if there
# are no errors
print("Connected to the database")
 
# close the connection
connection.close()

Connected to the database

In [ ]:
import sqlite3
 
# connecting to the database
connection = sqlite3.connect("gfg.db")
 
# cursor
crsr = connection.cursor()
 
# SQL command to create a table in the database
sql_command = """
CREATE TABLE emp (
staff_number INTEGER PRIMARY KEY,
fname VARCHAR(20),
lname VARCHAR(30),
gender CHAR(1),
joining DATE);
"""
 
# execute the statement
crsr.execute(sql_command)
 
# close the connection
connection.close()

In [ ]:
# Python code to demonstrate table creation and
# insertions with SQL
 
# importing module
import sqlite3
 
# connecting to the database
connection = sqlite3.connect("gfg.db")
 
# cursor
crsr = connection.cursor()
 
# SQL command to insert the data in the table
sql_command = """
INSERT INTO emp VALUES (23, "Rishabh", "Bansal", "M", "2014-03-28");
"""
crsr.execute(sql_command)
 
# another SQL command to insert the data in the table
sql_command = """
INSERT INTO emp VALUES (1, "Bill", "Gates", "M", "1980-10-28");
"""
crsr.execute(sql_command)
 
# To save the changes in the files. Never skip this.
# If we skip this, nothing will be saved in the database.
connection.commit()
 
# close the connection
connection.close()

In [ ]:
# importing module
import sqlite3
 
# connecting to the database
connection = sqlite3.connect("gfg.db")
 
# cursor
crsr = connection.cursor()
 
# primary key
pk = [2, 3, 4, 5, 6]
 
# Enter 5 students first names
f_name = ['Nikhil', 'Nisha', 'Abhinav', 'Raju', 'Anshul']
 
# Enter 5 students last names
l_name = ['Aggarwal', 'Rawat', 'Tomar', 'Kumar', 'Aggarwal']
 
# Enter their gender respectively
gender = ['M', 'F', 'M', 'M', 'F']
 
# Enter their joining data respectively
date = ['2019-08-24', '2020-01-01', '2018-05-14', '2015-02-02', '2018-05-14']
 
for i in range(5):
    # This is the q-mark style:
    crsr.execute(f'INSERT INTO emp VALUES ({pk[i]}, "{f_name[i]}", "{l_name[i]}", "{gender[i]}", "{date[i]}")')
 
# To save the changes in the files. Never skip this.
# If we skip this, nothing will be saved in the database.
connection.commit()
 
# close the connection
connection.close()

In [ ]:
# importing the module
import sqlite3
 
# connect with the myTable database
connection = sqlite3.connect("gfg.db")
 
# cursor object
crsr = connection.cursor()
 
# execute the command to fetch all the data from the table emp
crsr.execute("SELECT * FROM emp")
 
# store all the fetched data in the ans variable
ans = crsr.fetchall()
 
# Since we have already selected all the data entries
# using the "SELECT *" SQL command and stored them in
# the ans variable, all we need to do now is to print
# out the ans variable
for i in ans:
    print(i)

(1, 'Bill', 'Gates', 'M', '1980-10-28')
(2, 'Nikhil', 'Aggarwal', 'M', '2019-08-24')
(3, 'Nisha', 'Rawat', 'F', '2020-01-01')
(4, 'Abhinav', 'Tomar', 'M', '2018-05-14')
(5, 'Raju', 'Kumar', 'M', '2015-02-02')
(6, 'Anshul', 'Aggarwal', 'F', '2018-05-14')
(23, 'Rishabh', 'Bansal', 'M', '2014-03-28')

In [ ]:
type(ans[0])

tuple

In [ ]:
# Import module
import sqlite3
 
# Connecting to sqlite
conn = sqlite3.connect('gfg.db')
 
# Creating a cursor object using
# the cursor() method
cursor = conn.cursor()
 
# Updating
cursor.execute('''
UPDATE emp SET lname = "Jyoti" WHERE fname="Rishabh";
''')
 
# Commit your changes in the database
conn.commit()
 
# Closing the connection
conn.close()

In [ ]:
crsr.execute("SELECT * FROM emp")
ans = crsr.fetchall()
ans

[(1, 'Bill', 'Gates', 'M', '1980-10-28'),
 (2, 'Nikhil', 'Aggarwal', 'M', '2019-08-24'),
 (3, 'Nisha', 'Rawat', 'F', '2020-01-01'),
 (4, 'Abhinav', 'Tomar', 'M', '2018-05-14'),
 (5, 'Raju', 'Kumar', 'M', '2015-02-02'),
 (6, 'Anshul', 'Aggarwal', 'F', '2018-05-14'),
 (23, 'Rishabh', 'Jyoti', 'M', '2014-03-28')]

In [ ]:
# Import module
import sqlite3
 
# Connecting to sqlite
conn = sqlite3.connect('gfg.db')
 
# Creating a cursor object using
# the cursor() method
cursor = conn.cursor()
 
# Updating
cursor.execute('''
DELETE FROM emp WHERE fname="Rishabh";
''')
 
# Commit your changes in the database
conn.commit()
 
# Closing the connection
conn.close()

In [ ]:
crsr.execute("SELECT * FROM emp")
ans = crsr.fetchall()
ans

[(1, 'Bill', 'Gates', 'M', '1980-10-28'),
 (2, 'Nikhil', 'Aggarwal', 'M', '2019-08-24'),
 (3, 'Nisha', 'Rawat', 'F', '2020-01-01'),
 (4, 'Abhinav', 'Tomar', 'M', '2018-05-14'),
 (5, 'Raju', 'Kumar', 'M', '2015-02-02'),
 (6, 'Anshul', 'Aggarwal', 'F', '2018-05-14')]

In [ ]:
import sqlite3
 
# connecting to the database
connection = sqlite3.connect("gfg.db")
 
# cursor
crsr = connection.cursor()
 
# SQL command to create a table in the database
sql_command = """
CREATE TABLE Student (
staff_number INTEGER PRIMARY KEY,
fname VARCHAR(20),
lname VARCHAR(30),
gender CHAR(1),
joining DATE);
"""
 
# execute the statement
crsr.execute(sql_command)
 
# close the connection
connection.close()

In [ ]:
# Import module
import sqlite3
 
# Connecting to sqlite
conn = sqlite3.connect('gfg.db')
 
# Creating a cursor object using
# the cursor() method
cursor = conn.cursor()
 
# Updating
cursor.execute('''
DROP TABLE Student;
''')
 
# Commit your changes in the database
conn.commit()
 
# Closing the connection
conn.close()

In [ ]:
try:
  conn = sqlite3.connect('gfg.db')
  crsr = conn.cursor()
  crsr.execute("SELECT * FROM Student")
  ans = crsr.fetchall()
  
except Exception as ans:
  print(ans)

no such table: Student

# [SQLite - Python](https://www.tutorialspoint.com/sqlite/sqlite_python.htm)

In [3]:
import sqlite3

conn = sqlite3.connect('test.db')

print ("Opened database successfully");

Opened database successfully

In [4]:
conn = sqlite3.connect('test.db')

conn.execute('''
CREATE TABLE COMPANY (
  ID INT PRIMARY KEY NOT NULL,
  NAME TEXT NOT NULL,
  AGE INT NOT NULL,
  ADDRESS CHAR(50),
  SALARY REAL
)
''')

conn.close()

In [5]:
conn = sqlite3.connect('test.db')

conn.execute('''
INSERT INTO COMPANY (
  ID, NAME, AGE, ADDRESS, SALARY
  ) VALUES (
    1, 'Paul', 32, 'California', 20000.00
  )
''')

conn.execute('''
INSERT INTO COMPANY (
  ID, NAME, AGE, ADDRESS, SALARY
  ) VALUES (
    2, 'Allen', 25, 'Texas', 15000.00
  )
''')

conn.execute('''
INSERT INTO COMPANY (
  ID, NAME, AGE, ADDRESS, SALARY
  ) VALUES (
    3, 'Teddy', 23, 'Norway', 20000.00
  )
''')

conn.execute('''
INSERT INTO COMPANY (
  ID, NAME, AGE, ADDRESS, SALARY
  ) VALUES (
    4, 'Mark', 25, 'Rich-Mond', 65000.00
  )
''')

conn.commit()
conn.close()

In [6]:
conn = sqlite3.connect('test.db')

cursor = conn.execute('''
SELECT ID, NAME, ADDRESS, SALARY FROM COMPANY
''')

for row in cursor:
  print(row)

conn.close()

(1, 'Paul', 'California', 20000.0)
(2, 'Allen', 'Texas', 15000.0)
(3, 'Teddy', 'Norway', 20000.0)
(4, 'Mark', 'Rich-Mond', 65000.0)

In [ ]:
conn = sqlite3.connect('test.db')

NAME = input('Enter NAME : ')
ADDRESS = input('Enter ADDRESS : ')

command = f'''
SELECT * FROM COMPANY
WHERE NAME='{NAME}' AND ADDRESS='{ADDRESS}'
'''

print(command)
cursor = conn.execute(command)

for row in cursor:
  print(row)

conn.close()

# Getting only one row, without knowing `Address`.

Enter NAME : Paul' --
Enter ADDRESS : 123

SELECT * FROM COMPANY
WHERE NAME='Paul' --' AND ADDRESS='123'

(1, 'Paul', 32, 'California', 20000.0)

# Implementing SQL Injection

In [ ]:
conn = sqlite3.connect('test.db')

NAME = input('Enter NAME : ')
ADDRESS = input('Enter ADDRESS : ')

command = f'''
SELECT * FROM COMPANY
WHERE NAME='{NAME}' AND ADDRESS='{ADDRESS}'
'''

print(command)
cursor = conn.execute(command)

for row in cursor:
  print(row)

conn.close()

Enter NAME : ' OR 1=1 --
Enter ADDRESS : 123

SELECT * FROM COMPANY
WHERE NAME='' OR 1=1 --' AND ADDRESS='123'

(1, 'Paul', 32, 'California', 20000.0)
(2, 'Allen', 25, 'Texas', 15000.0)
(3, 'Teddy', 23, 'Norway', 20000.0)
(4, 'Mark', 25, 'Rich-Mond', 65000.0)

In [10]:
import sqlite3

conn = sqlite3.connect('test.db')

conn.execute('''
UPDATE COMPANY SET SALARY = 25000.00
WHERE ID = 1
''')

print('Total number of rows updated : ', conn.total_changes)

crsr = conn.execute('''
SELECT ID, NAME, ADDRESS, SALARY FROM COMPANY
''')

conn.commit()

for row in crsr:
   print ("ID = ", row[0])
   print ("NAME = ", row[1])
   print ("ADDRESS = ", row[2])
   print ("SALARY = ", row[3], "\n")

print ("Operation done successfully")
conn.close()

Total number of rows updated :  1
ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation done successfully

In [14]:
import sqlite3

conn = sqlite3.connect('test.db')
print ("Opened database successfully");

conn.execute("DELETE from COMPANY where ID = 2;")
conn.commit()
print ("Total number of rows deleted :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
for row in cursor:
   print ("ID = ", row[0])
   print ("NAME = ", row[1])
   print ("ADDRESS = ", row[2])
   print ("SALARY = ", row[3], "\n")

print ("Operation done successfully")
conn.close()

Opened database successfully
Total number of rows deleted : 0
ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation done successfully